ruby-on-rails/testing-rails/app/controllers/tests_controller.rb

INSERT INTO "tests" ("first_name", "last_name", "email", "phone", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @test = Test.new(test_params)

    respond_to do |format|
      if @test.save

DELETE FROM "tests" WHERE "tests"."id" = ?  [["id", 1]]
---
  def destroy
    @test.destroy!